tap "go-task/tap"
tap "grafana/grafana"
tap "hashicorp/tap"
tap "heroku/brew"
tap "xykong/tap"

# ── Core CLI ──────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "glow"
brew "curl"
brew "wget"
brew "coreutils"
brew "stow"
brew "bat"
brew "fd"
brew "fswatch"
brew "ripgrep"
brew "jq"
brew "tree"
brew "tldr"
brew "entr"
brew "shellcheck"
brew "gnupg"

# ── Tmux ──────────────────────────────────────────────────────────────────────
brew "tmux"
brew "bash"
brew "bc"
brew "fzf"
brew "lazygit"

# ── Neovim ────────────────────────────────────────────────────────────────────
brew "neovim"
brew "luarocks"

# ── Languages & Runtimes ──────────────────────────────────────────────────────
brew "mise"
brew "yarn"

# ── Dev Tools ─────────────────────────────────────────────────────────────────
brew "git-gui"
brew "htop"
brew "ctop"
brew "dive"
brew "grafana/grafana/gcx"             # Grafana CLI
brew "mole"
brew "nmap"
brew "speedtest-cli"
brew "weave"                           # semantic merge driver for git

# ── Infrastructure ────────────────────────────────────────────────────────────
brew "age"
brew "ansible"
brew "azure-cli"
brew "awscli"
brew "sops"
brew "terraform"

# ── Kubernetes ────────────────────────────────────────────────────────────────
brew "tanka"
brew "jsonnet-bundler"
brew "go-jsonnet"
brew "kustomize"
brew "k3d"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "k9s"
brew "kubectx"
brew "tilt"

# ── Build Tools ───────────────────────────────────────────────────────────────
brew "go-task"
brew "heroku/brew/heroku"

# ── Media ─────────────────────────────────────────────────────────────────────
brew "ffmpeg"
brew "imagemagick"
#brew "vips"
brew "yt-dlp"

# ── Casks ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "brave-browser"
cask "claude"
cask "cleanshot"
cask "dbeaver-community"
cask "discord"
cask "flux-markdown"
cask "ghostty"
cask "google-chrome"
cask "handy"
cask "meetingbar"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "sequel-ace"
cask "signal"
cask "slack"
cask "spotify"
cask "tuple"
cask "visual-studio-code"
cask "whatsapp"
